<?php

namespace App\Http\Services\Common;

trait NgWordMaskingTrait {
    /**
     * @param array $formattedWordList
     * @return string
     */
    public function maskingProcess(array $formattedWordList):string
    {
        # ニコニコ動画NGワード一覧から抜粋
        $ngWords = [
            "喘いで", "乱交", "麻薬", "勃起", "包茎", "変態", "糞", "風俗", "不細工", "貧乳", "犯し", "馬鹿", "乳首", "肉棒", "童貞",
            "潰せ", "潮吹", "中田氏", "中出し", "谷間", "脱ごう", "脱げ", "脱いで", "大麻", "体位", "精子", "性器", "処女", "手マン",
            "手ブラ", "手コキ", "射精", "自慰", "氏ね", "死ん", "死の", "死ね", "死ぬ", "死な", "死す", "指マン", "殺そ", "殺せ", "殺す",
            "殺し", "殺さ", "乞食", "巨乳", "気違い", "基地外", "姦", "覚醒剤", "覚せい剤", "何カップ", "下乳", "横乳", "陰毛", "淫乱",
            "ローター", "レイプ", "やりまん", "まん個", "まんこ", "マンコ", "まんぐり", "まんk", "マソコ", "マスターベーション", "ま○こ", "ホモ",
            "ボッキ", "ほうけい", "ヘロイン", "ヘルス", "ペニス", "ブタ", "ブス", "ぶさいく", "フェラ", "ふうぞく", "ふーぞく", "ファック",
            "ひんにゅう", "ひんにゅー", "ビッチ", "ビーチク", "パンティ", "パンツ", "パンt", "ばばあ", "ばばぁ", "パコパコ", "バイブ",
            "パイパン", "ぱいぱい", "パイズリ", "ばーか", "ノーブラ", "ノーパン", "ぬごう", "ぬげ", "ぬいで", "なにカップ", "どーてー",
            "どーてい", "どうてー", "どうてい", "デリヘル", "てブラ", "チンポ", "ちんちん", "ちんこ", "ちんk", "ちくび", "ﾀﾋ", "たにま",
            "ソープ", "セックス", "スカトロ", "しね", "しぬ", "しこって", "しこしこ", "ザコ", "ザーメン", "ころせ", "ころす", "コカイン",
            "クンニ", "クリトリス", "くたばれ", "くず", "きんたま", "きょにゅう", "きょにゅー", "きもい", "きめえ", "オメコ", "オナヌ",
            "オナニ", "おっぱお", "おっぱい", "エッチ", "うんこ", "ヴァギナ", "いんもう", "アナル", "あえいで", "shine", "SEX", "S○X",
            "rapist", "penis", "oppai", "homo", "fuck", "f*ck", "bitch", "BBA", "baka", "anus", "●～", "○～", "子作り", "ショタ", "性的", "ロリ", "チンコ"
        ];

        $maskedSentence = '';

        foreach ($formattedWordList as $formattedWord) {
            if(in_array($formattedWord['notation'], $ngWords) ||  in_array($formattedWord['kana'], $ngWords)) {
                $maskedSentence = $maskedSentence.'☆☆☆';
                continue;
            }

            $maskedSentence = $maskedSentence.$formattedWord['notation'];
        }

        return $maskedSentence;
    }
}
